app/controllers/card_packs_controller.rb

  def index
    @card_packs = CardPack.all
---
SELECT "card_packs".* FROM "card_packs"