app/controllers/cards_controller.rb

SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @card = Card.find(params[:id])

INSERT INTO "cards" ("created_at", "info", "name", "set", "source", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @card = Card.new(params[:card])

    respond_to do |format|
      if @card.save