app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "id_facebook", "id_twitter", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 20 May 2012 10:15:55 UTC +00:00], ["email", "yoyoo"], ["id_facebook", 1], ["id_twitter", 2], ["name", "yo"], ["updated_at", Sun, 20 May 2012 10:15:55 UTC +00:00]]