app/controllers/user_cards_controller.rb

  def index
    @user_cards = UserCard.all
---
SELECT "user_cards".* FROM "user_cards"

  def show
    @user_card = UserCard.find(params[:id])
---
SELECT "user_cards".* FROM "user_cards" WHERE "user_cards"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @user_card = UserCard.find(params[:id])
---
SELECT "user_cards".* FROM "user_cards" WHERE "user_cards"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @user_card = UserCard.new(params[:user_card])

    respond_to do |format|
      if @user_card.save
---
INSERT INTO "user_cards" ("card_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["card_id", nil], ["created_at", Sun, 20 May 2012 11:08:40 UTC +00:00], ["updated_at", Sun, 20 May 2012 11:08:40 UTC +00:00], ["user_id", nil]]

  def update
    @user_card = UserCard.find(params[:id])

    respond_to do |format|
      if @user_card.update_attributes(params[:user_card].except(:id, :created_at, :updated_at))
---
SELECT "user_cards".* FROM "user_cards" WHERE "user_cards"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "user_cards" SET "user_id" = 3, "card_id" = 2, "updated_at" = '2012-05-20 16:03:04.746427' WHERE "user_cards"."id" = 3

  def destroy
    @user_card = UserCard.find(params[:id])
    @user_card.destroy
---
SELECT "user_cards".* FROM "user_cards" WHERE "user_cards"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "user_cards" WHERE "user_cards"."id" = ?  [["id", 1]]